{
  "app_name": "Jellyfin",
  "last_updated": "2025-12-28",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2025-31499",
      "published_date": "2025-04-15",
      "last_modified_date": "2025-10-06",
      "base_score": 8.8,
      "severity": "HIGH",
      "description": "Jellyfin is an open source self hosted media server. Versions before 10.10.7 are vulnerable to argument injection in FFmpeg. This can be leveraged to possibly achieve remote code execution by anyone with credentials to a low-privileged user. This vulnerability was previously reported in CVE-2023-49096 and patched in version 10.8.13, but the patch can be bypassed. The original fix sanitizes some parameters to make injection impossible, but certain unsanitized parameters can still be used for argument injection. The same unauthenticated endpoints are vulnerable: /Videos/<itemId>/stream and /Videos/<itemId>/stream.<container>, likely alongside similar endpoints in AudioController. This argument injection can be exploited to achieve arbitrary file write, leading to possible remote code execution through the plugin system. While the unauthenticated endpoints are vulnerable, a valid itemId is required for exploitation and any authenticated attacker could easily retrieve a valid itemId to make the exploit work. This vulnerability is patched in version 10.10.7.",
      "cpe_name": "cpe:2.3:a:jellyfin:jellyfin:10.9.10:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2025-32012",
      "published_date": "2025-04-15",
      "last_modified_date": "2025-10-06",
      "base_score": 7.5,
      "severity": "HIGH",
      "description": "Jellyfin is an open source self hosted media server. In versions 10.9.0 to before 10.10.7, the /System/Restart endpoint provides administrators the ability to restart their Jellyfin server. This endpoint is intended to be admins-only, but it also authorizes requests from any device in the same local network as the Jellyfin server. Due to the method Jellyfin uses to determine the source IP of a request, an unauthenticated attacker is able to spoof their IP to appear as a LAN IP, allowing them to restart the Jellyfin server process without authentication. This means that an unauthenticated attacker could mount a denial-of-service attack on any default-configured Jellyfin server by simply sending the same spoofed request every few seconds to restart the server over and over. This method of IP spoofing also bypasses some security mechanisms, cause a denial-of-service attack, and possible bypass the admin restart requirement if combined with remote code execution. This issue is patched in version 10.10.7.",
      "cpe_name": "cpe:2.3:a:jellyfin:jellyfin:10.9.10:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2024-43801",
      "published_date": "2024-09-02",
      "last_modified_date": "2024-11-21",
      "base_score": 4.6,
      "severity": "MEDIUM",
      "description": "Jellyfin is an open source self hosted media server. The Jellyfin user profile image upload accepts SVG files, allowing for a stored XSS attack against an admin user via a specially crafted malicious SVG file. When viewed by an admin outside of the Jellyfin Web UI (e.g. via \"view image\" in a browser), this malicious SVG file could interact with the browser's LocalStorage and retrieve an AccessToken, which in turn can be used in an API call to elevate the target user to a Jellyfin administrator. The actual attack vector is unlikely to be exploited, as it requires specific actions by the administrator to view the SVG image outside of Jellyfin's WebUI, i.e. it is not a passive attack. The underlying exploit mechanism is solved by PR #12490, which forces attached images (including the potential malicious SVG) to be treated as attachments and thus downloaded by browsers, rather than viewed. This prevents exploitation of the LocalStorage of the browser. This PR has been merged and the relevant code changes are included in release version 10.9.10. All users are advised to upgrade.",
      "cpe_name": "cpe:2.3:a:jellyfin:jellyfin:10.9.10:*:*:*:*:*:*:*"
    }
  ]
}