{
  "app_name": "Webex Teams",
  "app_key": "webex_teams",
  "last_updated": "2026-01-28",
  "total_cves": 19,
  "summary": {
    "critical": 0,
    "high": 9,
    "medium": 10,
    "low": 0,
    "kev_count": 0
  },
  "vulnerabilities": [
    {
      "cve_id": "CVE-2025-20236",
      "published_date": "2025-04-16",
      "last_modified_date": "2025-08-01",
      "description": "A vulnerability in the custom URL parser of Cisco Webex App could allow an unauthenticated, remote attacker to persuade a user to download arbitrary files, which could allow the attacker to execute arbitrary commands on the host of the targeted user.\r\n\r\nThis vulnerability is due to insufficient input validation when Cisco Webex App processes a meeting invite link. An attacker could exploit this vulnerability by persuading a user to click a crafted meeting invite link and download arbitrary files. A successful exploit could allow the attacker to execute arbitrary commands with the privileges of the targeted user.",
      "base_score": 8.8,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2021-1502",
      "published_date": "2021-06-04",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in Cisco Webex Network Recording Player for Windows and MacOS and Cisco Webex Player for Windows and MacOS could allow an attacker to execute arbitrary code on an affected system. The vulnerability is due to insufficient validation of values within Webex recording files formatted as either Advanced Recording Format (ARF) or Webex Recording Format (WRF). An attacker could exploit the vulnerability by sending a user a malicious ARF or WRF file through a link or email attachment and persuading the user to open the file. A successful exploit could allow the attacker to execute arbitrary code on the affected system with the privileges of the targeted user.",
      "base_score": 7.8,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "41.5",
      "affected_version_end_type": "excluding",
      "fixed_version": "41.5",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2020-3535",
      "published_date": "2020-10-08",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the loading mechanism of specific DLLs in the Cisco Webex Teams client for Windows could allow an authenticated, local attacker to load a malicious library. To exploit this vulnerability, the attacker needs valid credentials on the Windows system. The vulnerability is due to incorrect handling of directory paths at run time. An attacker could exploit this vulnerability by placing a malicious DLL file in a specific location on the targeted system. This file will execute when the vulnerable application launches. A successful exploit could allow the attacker to execute arbitrary code on the targeted system with the privileges of another user&rsquo;s account.",
      "base_score": 7.8,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
      "affected_version_start": "3.0.13464.0",
      "affected_version_start_type": "including",
      "affected_version_end": "3.0.16040.0",
      "affected_version_end_type": "including",
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2020-3155",
      "published_date": "2020-03-04",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the SSL implementation of the Cisco Intelligent Proximity solution could allow an unauthenticated, remote attacker to view or alter information shared on Cisco Webex video devices and Cisco collaboration endpoints if the products meet the conditions described in the Vulnerable Products section. The vulnerability is due to a lack of validation of the SSL server certificate received when establishing a connection to a Cisco Webex video device or a Cisco collaboration endpoint. An attacker could exploit this vulnerability by using man in the middle (MITM) techniques to intercept the traffic between the affected client and an endpoint, and then using a forged certificate to impersonate the endpoint. Depending on the configuration of the endpoint, an exploit could allow the attacker to view presentation content shared on it, modify any content being presented by the victim, or have access to call controls. This vulnerability does not affect cloud registered collaboration endpoints.",
      "base_score": 7.4,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2019-1939",
      "published_date": "2019-09-05",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the Cisco Webex Teams client for Windows could allow an unauthenticated, remote attacker to execute arbitrary commands on an affected system. This vulnerability is due to improper restrictions on software logging features used by the application on Windows operating systems. An attacker could exploit this vulnerability by convincing a targeted user to visit a website designed to submit malicious input to the affected application. A successful exploit could allow the attacker to cause the application to modify files and execute arbitrary commands on the system with the privileges of the targeted user.",
      "base_score": 8.8,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "3.0.12427.0",
      "affected_version_end_type": "excluding",
      "fixed_version": "3.0.12427.0",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2019-1689",
      "published_date": "2019-02-25",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the client application for iOS of Cisco Webex Teams could allow an authenticated, remote attacker to upload arbitrary files within the scope of the iOS application. The vulnerability is due to improper input validation in the client application. An attacker could exploit this vulnerability by sending a malicious file to a targeted user and persuading the user to manually open it. An exploit could allow the attacker to overwrite sensitive application files and eventually cause a denial of service (DoS) condition by foreclosing future access to the system to the targeted user. This vulnerability is fixed in version 3.13.26920.",
      "base_score": 7.3,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:N/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "3.13.26920",
      "affected_version_end_type": "excluding",
      "fixed_version": "3.13.26920",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2019-1636",
      "published_date": "2019-01-23",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the Cisco Webex Teams client, formerly Cisco Spark, could allow an attacker to execute arbitrary commands on a targeted system. This vulnerability is due to unsafe search paths used by the application URI that is defined in Windows operating systems. An attacker could exploit this vulnerability by convincing a targeted user to follow a malicious link. Successful exploitation could cause the application to load libraries from the directory targeted by the URI link. The attacker could use this behavior to execute arbitrary commands on the system with the privileges of the targeted user if the attacker can place a crafted library in a directory that is accessible to the vulnerable system.",
      "base_score": 7.8,
      "severity": "HIGH",
      "cvss_version": "3.0",
      "cvss_vector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2018-0436",
      "published_date": "2018-10-05",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in Cisco Webex Teams, formerly Cisco Spark, could allow an authenticated, remote attacker to view and modify data for an organization other than their own organization. The vulnerability exists because the affected software performs insufficient checks for associations between user accounts and organization accounts. An attacker who has administrator or compliance officer privileges for one organization account could exploit this vulnerability by using those privileges to view and modify data for another organization account. No customer data was impacted by this vulnerability.",
      "base_score": 8.7,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "10.6.0",
      "affected_version_end_type": "excluding",
      "fixed_version": "10.6.0",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2018-0387",
      "published_date": "2018-07-18",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in Cisco Webex Teams (for Windows and macOS) could allow an unauthenticated, remote attacker to execute arbitrary code on the user's device, possibly with elevated privileges. The vulnerability occurs because Cisco Webex Teams does not properly sanitize input. An attacker could exploit the vulnerability by sending a user a malicious link and persuading the user to follow the link. A successful exploit could allow the attacker to execute arbitrary code on the user's system. Cisco Bug IDs: CSCvh66250.",
      "base_score": 8.8,
      "severity": "HIGH",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2020-26067",
      "published_date": "2024-11-18",
      "last_modified_date": "2025-08-01",
      "description": "A vulnerability in the web-based interface of Cisco&nbsp;Webex Teams could allow an authenticated, remote attacker to conduct cross-site scripting attacks.\r\nThe vulnerability is due to improper validation of usernames. An attacker could exploit this vulnerability by creating an account that contains malicious HTML or script content and joining a space using the malicious account name. A successful exploit could allow the attacker to conduct cross-site scripting attacks and potentially gain access to sensitive browser-based information.Cisco&nbsp;has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.",
      "base_score": 5.4,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2024-20395",
      "published_date": "2024-07-17",
      "last_modified_date": "2025-07-31",
      "description": "A vulnerability in the media retrieval functionality of Cisco Webex App could allow an unauthenticated, adjacent attacker to gain access to sensitive session information.\r\n\r This vulnerability is due to insecure transmission of requests to backend services when the app accesses embedded media, such as images. An attacker could exploit this vulnerability by sending a message with embedded media that is stored on a messaging server to a targeted user. If the attacker can observe transmitted traffic in a privileged network position, a successful exploit could allow the attacker to capture session token information from insecurely transmitted requests and possibly reuse the captured session information to take further actions as the targeted user.",
      "base_score": 6.4,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2024-20396",
      "published_date": "2024-07-17",
      "last_modified_date": "2025-07-31",
      "description": "A vulnerability in the protocol handlers of Cisco Webex App could allow an unauthenticated, remote attacker to gain access to sensitive information.\r\n\r This vulnerability exists because the affected application does not safely handle file protocol handlers. An attacker could exploit this vulnerability by persuading a user to follow a link that is designed to cause the application to send requests. If the attacker can observe transmitted traffic in a privileged network position, a successful exploit could allow the attacker to capture sensitive information, including credential information, from the requests.",
      "base_score": 5.3,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2023-20104",
      "published_date": "2023-03-03",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the file upload functionality of Cisco Webex App for Web could allow an unauthenticated, remote attacker to conduct a cross-site scripting (XSS) attack against a user of the interface. This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by sending an arbitrary file to a user and persuading that user to browse to a specific URL. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information.",
      "base_score": 6.1,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2022-20863",
      "published_date": "2022-09-08",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the messaging interface of Cisco Webex App, formerly Webex Teams, could allow an unauthenticated, remote attacker to manipulate links or other content within the messaging interface. This vulnerability exists because the affected software does not properly handle character rendering. An attacker could exploit this vulnerability by sending messages within the application interface. A successful exploit could allow the attacker to modify the display of links or other content within the interface, potentially allowing the attacker to conduct phishing or spoofing attacks.",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "42.7",
      "affected_version_end_type": "excluding",
      "fixed_version": "42.7",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2021-1536",
      "published_date": "2021-06-04",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in Cisco Webex Meetings Desktop App for Windows, Cisco Webex Meetings Server, Cisco Webex Network Recording Player for Windows, and Cisco Webex Teams for Windows could allow an authenticated, local attacker to perform a DLL injection attack on an affected device. To exploit this vulnerability, the attacker must have valid credentials on the Windows system. This vulnerability is due to incorrect handling of directory paths at run time. An attacker could exploit this vulnerability by inserting a configuration file in a specific path in the system, which can cause a malicious DLL file to be loaded when the application starts. A successful exploit could allow the attacker to execute arbitrary code on the affected system with the privileges of another user account.",
      "base_score": 4.8,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2021-1242",
      "published_date": "2021-01-13",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in Cisco Webex Teams could allow an unauthenticated, remote attacker to manipulate file names within the messaging interface. The vulnerability exists because the affected software mishandles character rendering. An attacker could exploit this vulnerability by sharing a file within the application interface. A successful exploit could allow the attacker to modify how the shared file name displays within the interface, which could allow the attacker to conduct phishing or spoofing attacks.",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "40.12.0.17293",
      "affected_version_end_type": "excluding",
      "fixed_version": "40.12.0.17293",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2020-3541",
      "published_date": "2020-09-04",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the media engine component of Cisco Webex Meetings Client for Windows, Cisco Webex Meetings Desktop App for Windows, and Cisco Webex Teams for Windows could allow an authenticated, local attacker to gain access to sensitive information. The vulnerability is due to unsafe logging of authentication requests by the affected software. An attacker could exploit this vulnerability by reading log files that are stored in the application directory. A successful exploit could allow the attacker to gain access to sensitive information, which could be used in further attacks.",
      "base_score": 4.4,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "39.5.25",
      "affected_version_end_type": "excluding",
      "fixed_version": "39.5.25",
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2020-3131",
      "published_date": "2020-01-26",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the Cisco Webex Teams client for Windows could allow an authenticated, remote attacker to cause the client to crash, resulting in a denial of service (DoS) condition. The attacker needs a valid developer account to exploit this vulnerability. The vulnerability is due to insufficient input validation when processing received adaptive cards. The attacker could exploit this vulnerability by sending an adaptive card with malicious content to an existing user of the Cisco Webex Teams client for Windows. A successful exploit could allow the attacker to cause the targeted user's client to crash continuously. This vulnerability was introduced in Cisco Webex Teams client for Windows Release 3.0.13131.",
      "base_score": 6.5,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": "3.0.13131",
      "affected_version_end_type": "including",
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    },
    {
      "cve_id": "CVE-2019-16001",
      "published_date": "2019-11-26",
      "last_modified_date": "2024-11-21",
      "description": "A vulnerability in the loading mechanism of specific dynamic link libraries in Cisco Webex Teams for Windows could allow an authenticated, local attacker to perform a DLL hijacking attack. To exploit this vulnerability, the attacker would need to have valid credentials on the Windows system. The vulnerability is due to insufficient validation of the resources loaded by the application at run time. An attacker could exploit this vulnerability by crafting a malicious DLL file and placing it in a specific location on the targeted system. The malicious DLL file would execute when the vulnerable application is launched. A successful exploit could allow the attacker to execute arbitrary code on the target machine with the privileges of another user account.",
      "base_score": 5.3,
      "severity": "MEDIUM",
      "cvss_version": "3.1",
      "cvss_vector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L",
      "affected_version_start": null,
      "affected_version_start_type": null,
      "affected_version_end": null,
      "affected_version_end_type": null,
      "fixed_version": null,
      "is_kev": false,
      "kev_date_added": null,
      "kev_due_date": null,
      "kev_ransomware_use": null,
      "vendor": "cisco",
      "product": "webex_teams"
    }
  ]
}